2024-09-05-db-notes:-hash-tables.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="This is a personal note for the [[https://15445.courses.cs.cmu.edu/fall2023/notes/07-hashtables.pdf][CMU 15-445 L7 notes]]">
<link rel="alternate"
      type="application/rss+xml"
      href="https://chenyo.me/rss.xml"
      title="RSS feed for https://chenyo.me">
<title>CMU 15-445 notes: Hash Tables</title>
       <meta name="author" content="chenyo">
      <meta name="referrer" content="no-referrer">
      <meta name="viewport" content="width=device-width, initial-scale=1.0">
      <link rel="stylesheet" href="assets/style.css" type="text/css"/>
      <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css"/>
      <link rel="favicon" type="image/x-icon" href="favicon.ico">
</head>
<body>
<div id="preamble" class="status">
      <header>
      <h1><a href="https://chenyo.me">Chenyo's org-static-blog</a></h1>
      <nav>
      <a href="https://chenyo.me">Home</a>
      <a href="archive.html">Archive</a>
      <a href="tags.html">Tags</a>
      <div id="search-container">
        <input type="text" id="search-input" placeholder="Search anywhere...">
        <i class="fas fa-search search-icon"></i>
      </div>
      </nav>
      </header></div>
<div id="content">
<div class="post-date">05 Sep 2024</div><h1 class="post-title"><a href="https://chenyo.me/2024-09-05-db-notes:-hash-tables.html">CMU 15-445 notes: Hash Tables</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3d6480a">1. DBMS data structure application</a>
<ul>
<li><a href="#org18347eb">1.1. Design decisions</a></li>
</ul>
</li>
<li><a href="#org2b3a3e1">2. Hash tables</a></li>
<li><a href="#org77a6c5e">3. Hash function</a></li>
<li><a href="#orgea6956c">4. Hashing scheme</a></li>
<li><a href="#org85d5c9f">5. Static hashing scheme</a>
<ul>
<li><a href="#org357fa6e">5.1. Linear probe hashing</a>
<ul>
<li><a href="#orgd5ae410">5.1.1. Non-unique keys</a></li>
<li><a href="#org14664a7">5.1.2. Optimization</a></li>
</ul>
</li>
<li><a href="#org69e74f7">5.2. Cuckoo hashing</a></li>
</ul>
</li>
<li><a href="#org1eabb44">6. Dynamic hashing schemes</a>
<ul>
<li><a href="#org8ea041c">6.1. Chained Hashing</a></li>
<li><a href="#org71ff780">6.2. Extendible hashing</a></li>
<li><a href="#org727fb14">6.3. Linear hashing</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
This is a personal note for the <a href="https://15445.courses.cs.cmu.edu/fall2023/notes/07-hashtables.pdf">CMU 15-445 L7 notes</a> as well as some explanation from Claude.ai.
</p>
<div id="outline-container-org3d6480a" class="outline-2">
<h2 id="org3d6480a"><span class="section-number-2">1.</span> DBMS data structure application</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Internal meta-data: <a href="https://chenyo.me/2024-08-13-db-notes:-memory-management.html#org7a44495">page tables</a>, <a href="https://chenyo.me/2024-07-31-db-notes:-database-storage.html#org66626ef">page directories</a>.</li>
<li>Tuple storage on disk.</li>
<li>Table indices: easy to find specific tuples.</li>
</ul>
</div>
<div id="outline-container-org18347eb" class="outline-3">
<h3 id="org18347eb"><span class="section-number-3">1.1.</span> Design decisions</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Data layout for efficient access.</li>
<li>Concurrent access to data structures.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2b3a3e1" class="outline-2">
<h2 id="org2b3a3e1"><span class="section-number-2">2.</span> Hash tables</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Implements an associative array that maps keys to values.</li>
<li>On average \(O(1)\) operation complexity with the worst case \(O(n)\); \(O(n)\) storage complexity.
<ul class="org-ul">
<li>Optimization for constant complexity is important in real world.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org77a6c5e" class="outline-2">
<h2 id="org77a6c5e"><span class="section-number-2">3.</span> Hash function</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Maps a large key space into a smaller domain.</li>
<li>Takes in any key as input, and returns a deterministic integer representation.</li>
<li>Needs to consider the trade-off between fast execution and collision rate.
<ul class="org-ul">
<li>Does not need to be cryptographically.</li>
<li>The state-of-art (Fall 2023) hash function is XXHash3.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgea6956c" class="outline-2">
<h2 id="orgea6956c"><span class="section-number-2">4.</span> Hashing scheme</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Handles key collision after hashing.</li>
<li>Needs to consider the trade-off between large table allocation (to avoid collision) and additional instruction execution when a collision occurs.</li>
</ul>
</div>
</div>
<div id="outline-container-org85d5c9f" class="outline-2">
<h2 id="org85d5c9f"><span class="section-number-2">5.</span> Static hashing scheme</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>The hash table size is fixed; the DBMS has to rebuild a larger hash table (e.g., twice the size) from scratch when it runs out of space.</li>
</ul>
</div>
<div id="outline-container-org357fa6e" class="outline-3">
<h3 id="org357fa6e"><span class="section-number-3">5.1.</span> Linear probe hashing</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Insertion: when a collision occurs, linearly search the adjacent slots in a circular buffer until a open one is found.</li>
<li>Lookup: search linearly from the first hashed slot until the desired entry or an empty slot is reached, or every slot has been iterated.
<ul class="org-ul">
<li>Requires to store both key and value in the slot.</li>
</ul></li>
<li>Deletion: simply deleting the entry prevents future lookups as it becomes empty; two solutions:
<ul class="org-ul">
<li>Replace the deleted entry with a dummy entry to tell future lookups to keep scanning.</li>
<li>Shift the adjacent entries which were originally shifted, i.e., those who were originally hashed to the same key.
<ul class="org-ul">
<li>Very expensive and rarely implemented in practice.</li>
</ul></li>
</ul></li>
<li>The state-of-art linear probe hashing is Google <code>absl::flat_hash_map</code>.</li>
</ul>
</div>
<div id="outline-container-orgd5ae410" class="outline-4">
<h4 id="orgd5ae410"><span class="section-number-4">5.1.1.</span> Non-unique keys</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>The same key may be associated with multiple different values.</li>
<li>Separate linked list: each value is a pointer to a linked list of all values, which may overflow to multiple pages.</li>
<li>Redundant keys: store the same key multiple times with different values.
<ul class="org-ul">
<li>A more common approach.</li>
<li>Linear probing still works, if it is fine to get one value.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org14664a7" class="outline-4">
<h4 id="org14664a7"><span class="section-number-4">5.1.2.</span> Optimization</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>Specialized hash table based on key types and size; e.g., for long string keys, one can store the pointer or the hash of the long string in the hash table.</li>
<li>Store metadata in a separate array, e.g., store empty slot in a bitmap to avoid looking up deleted keys.</li>
<li><b><b>Version control</b></b> of hash tables: invalidate entries by incrementing the version counter rather than explicitly marking the deletion.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org69e74f7" class="outline-3">
<h3 id="org69e74f7"><span class="section-number-3">5.2.</span> Cuckoo hashing</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Maintains multiple hash tables with different hash functions to generate different hashes for the same key using different seeds.</li>
<li>Insertion: check each table and choose one with a free slot; if none table has free slot, choose and evict an old entry and find it another table.
<ul class="org-ul">
<li>If a rare cycle happens, rebuild all hash tables with new seeds or with larger tables.</li>
</ul></li>
<li>\(O(1)\) lookups and deletion (also needs to store keys), but insertion is more expensive.</li>
<li>Practical implementation maps a key to different slots in a single hash table.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1eabb44" class="outline-2">
<h2 id="org1eabb44"><span class="section-number-2">6.</span> Dynamic hashing schemes</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Resize the hash table on demand without rebuilding the entire table.</li>
</ul>
</div>
<div id="outline-container-org8ea041c" class="outline-3">
<h3 id="org8ea041c"><span class="section-number-3">6.1.</span> Chained Hashing</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Maintains a linked list of buckets for each slot in the hash table; keys hashed to the same slot are inserted into the linked list.</li>
<li>Lookup: hash to the key&rsquo;s bucket and scan for it.</li>
<li>Optimization: store bloom filter in the bucket pointer list to tell if a key exist in the linked list.</li>
</ul>
</div>
</div>
<div id="outline-container-org71ff780" class="outline-3">
<h3 id="org71ff780"><span class="section-number-3">6.2.</span> Extendible hashing</h3>
</div>

<div id="outline-container-org727fb14" class="outline-3">
<h3 id="org727fb14"><span class="section-number-3">6.3.</span> Linear hashing</h3>
</div>
</div>
<div class="taglist"><a href="https://chenyo.me/tags.html">Tags</a>: <a href="https://chenyo.me/tag-study.html">study</a> <a href="https://chenyo.me/tag-database.html">database</a> <a href="https://chenyo.me/tag-cmu.html">cmu</a> </div></div>
<div id="postamble" class="status"><div id="search-results"></div>
      <footer>
        <p>© 2024 chenyo. Some rights reserved.</p>
        <div class="social-links">
          <a href="https://t.me/feihuadawangjiushiwo" target="_blank" rel="noopener noreferrer">
          <i class="fab fa-telegram"></i>
          </a>
          <a href="https://github.com/chenyo-17" target="_blank" rel="noopener noreferrer">
            <i class="fab fa-github"></i>
      </a>
      </div>
      </footer></div>
</body>
</html>
